AELovelace/Doll-OS-Tab5/sdkconfig.defaults
# Match the stable M5Tab5 UserDemo baseline.
CONFIG_IDF_TARGET="esp32p4"
# PlatformIO does not forward the board JSON variant when Arduino is an IDF
# component, so select Arduino's ESP32-P4 pins/include variant explicitly.
CONFIG_ARDUINO_VARIANT="esp32p4"
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_IDF_EXPERIMENTAL_FEATURES=y

# Build Arduino as an IDF component and preserve normal setup()/loop() startup.
CONFIG_AUTOSTART_ARDUINO=y
CONFIG_FREERTOS_HZ=1000

# Diagnostic build: compile the task-WDT API required by Arduino, but do not initialize
# the watchdog or subscribe idle tasks at runtime.
CONFIG_ESP_TASK_WDT_EN=y
# CONFIG_ESP_TASK_WDT_INIT is not set

# These four settings are the display-bandwidth fix used by M5Stack's UserDemo
# and recommended by Espressif for PSRAM-backed MIPI-DSI scanout.
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_XIP_FROM_PSRAM=y
CONFIG_CACHE_L2_CACHE_256KB=y
CONFIG_CACHE_L2_CACHE_LINE_128B=y

# Arduino's NetworkClientSecure requires at least one PSK exchange mode.
CONFIG_MBEDTLS_PSK_MODES=y
CONFIG_MBEDTLS_KEY_EXCHANGE_PSK=y
CONFIG_MBEDTLS_KEY_EXCHANGE_ECDHE_PSK=y
CONFIG_MBEDTLS_KEY_EXCHANGE_RSA_PSK=y
